# -*- coding: GBK -*-

from data import ChangesDiagrams

Changes_Txt = dict()

Changes_Txt = {
    ChangesDiagrams.QIAN : [
        "乾:元亨，利贞",
        "亢龙有悔",
        "龙在天，利见大人",
        "或跃在渊，无咎",
        "君子终日乾乾，夕惕若厉，无咎",
        "见龙在田，利见大人",
        "潜龙，勿用",    
        "见群龙无首，吉"
    ],

    ChangesDiagrams.KUN : [
        "坤：元亨，利牝马之贞。君子有攸往，先迷后得主，利；\n    西南得朋，东北丧朋，安贞吉",
        "龙战于野，其血玄黄",
        "黄裳，元吉",
        "括囊，无咎无誉",
        "含章可贞，或从王事，无成有终",
        "直方大，不习无不利",
        "履霜，坚冰至",
        "利永贞"
    ],

    ChangesDiagrams.ZHUN : [
        "屯：元亨利贞。勿用有攸往，利建侯",
        "乘马班如，泣血涟如",
        "屯其膏，小贞吉，大贞凶",
        "乘马班如，求婚媾，往吉，无不利",
        "既鹿无虞，惟入于林中。君子几，不如舍，往吝",
        "屯如邅如，乘马班如。匪寇，婚媾，女子贞不字，十年乃字",
        "磐桓，利居贞，利建侯",
    ],

    ChangesDiagrams.MENG : [
        "蒙：亨。匪我求童蒙，童蒙求我。\n    初噬告，再三渎，渎则不告。利贞。",
        "击蒙，不利为寇，利御寇。",
        "童蒙，吉。",
        "困蒙，吝。",
        "勿用娶女，见金夫，不有躬，无攸利。",
        "包蒙，吉。纳妇，吉；子克家。",
        "发蒙，利用刑人，用说桎梏；以往吝。",
    ],

    ChangesDiagrams.XU : [
        "需：有孚，光亨，贞吉。利涉大川。",
        "入于穴，有不速之客三人 来，敬之终吉。",
        "需于酒食，贞吉。",
        "需于血，出自穴。",
        "需于泥，致寇至。",
        "需于沙，小有言，终吉。",
        "需于郊，利用恒，无咎。",
    ],

    ChangesDiagrams.SONG : [
        "讼：有孚，窒惕，中吉。终凶。利见大人，不利涉大川。",
        "或锡之鞶带，终朝三褫之。",
        "讼，元吉。",
        "不克讼，复自命，渝安贞，吉。",
        "食旧德，贞厉，终吉。或从王事，无成。",
        "不克讼，归而逋，其邑人三百户无眚。",
        "不永所事，小有言，终吉。",
    ],

    ChangesDiagrams.SHI : [
        "师：贞，丈人吉，无咎。",
        "大君有命，开国承家，小人勿用。",
        "田有禽，利执；言，无咎。长子帅师，弟子舆尸，贞凶。",
        "师左次，无咎。",
        "师或舆尸，凶。",
        "在师，中吉，无咎，王三锡命。",
        "师出以律，否臧凶。",
    ],

    ChangesDiagrams.BI : [
        "比：吉。原筮，元永贞，无咎。不宁方来，后夫凶。",
        "比之无首，凶。",
        "显比，王用三驱，失前禽。邑人不诫，吉。",
        "外比之，贞吉。",
        "比之匪人。",
        "比之自内，贞吉。",
        "有孚比之，无咎。有孚盈缶，终来有它吉。",
    ],

    ChangesDiagrams.XIAOXU : [
        "小畜：亨。密云不雨，自我西郊。",
        "既雨既处，尚德载。妇贞厉。月几望，君子征凶。",
        "有孚挛如，富以其邻。",
        "有孚，血去惕出，无咎。",
        "舆说辐，夫妻反目。",
        "牵复，吉。",
        "复自道，何其咎？吉。",
    ],

    ChangesDiagrams.LV : [
        "履：履虎尾，不咥人，亨。",
        "视履考祥，其旋元吉。",
        "夬履，贞厉。",
        "履虎尾，愬愬，终吉。",
        "眇能视，跛能履。履虎尾，咥人，凶。武人为于大君。",
        "履道坦坦，幽人贞吉。",
        "素履往，无咎。",
    ],

    ChangesDiagrams.TAI : [
        "泰：小往大来，吉亨。",
        "城复于隍，勿用师。自邑告命，贞吝。",
        "帝乙归妹，以祉元吉。",
        "翩翩，不富以其邻，不戒以孚。",
        "无平不陂，无往不复，艰贞无咎。勿恤其孚，于食有福。",
        "包荒，用冯河，不遐遗。朋亡，得尚于中行。",
        "拔茅茹，以其汇，征吉。",
    ],

    ChangesDiagrams.PI : [
        "否：否之匪人，不利君子贞，大往小来。",
        "倾否，先否后喜。",
        "休否，大人吉。其亡其亡，系于苞桑。",
        "有命无咎，畴离祉。",
        "包羞。",
        "包承，小人吉，大人否，亨。",
        "拔茅茹，以其汇，贞吉，亨。",
    ],

    ChangesDiagrams.TONGREN : [
        "同人：同人于野，亨。利涉大川，利君子贞。",
        "同人于郊，无悔。",
        "同人，先号咷而后笑。大师克相遇。",
        "乘其墉，弗克攻，吉。",
        "伏戎于莽，升其高陵，三岁不兴。",
        "同人于宗，吝。",
        "同人于门，无咎。",
    ],

    ChangesDiagrams.DAYOU : [
        "大有：元亨。",
        "自天佑之，吉无不利。",
        "厥孚交如，威如，吉。",
        "匪其彭，无咎。",
        "公用亨于天子，小人弗克。",
        "大车以载，有攸往，无咎。",
        "无交害，匪咎，艰则无咎。",
    ],

    ChangesDiagrams.DI_SHAN_QIAN : [
        "谦：亨，君子有终。",
        "鸣谦，利用行师，征邑国。",
        "不富以其邻，利用侵伐，无不利。",
        "无不利，?谦。",
        "劳谦君子，有终，吉。",
        "鸣谦，贞吉。",
        "谦谦君子，用涉大川，吉。",
    ],

    ChangesDiagrams.YU : [
        "豫：利建侯行师。",
        "冥豫，成有渝，无咎。",
        "贞疾，恒不死。",
        "由豫，大有得。勿疑，朋盍簪。",
        "盱豫，悔。迟有悔。",
        "介于石，不终日，贞吉。",
        "鸣豫，凶。",
    ],

    ChangesDiagrams.SUI : [
        "随：元亨利贞，无咎。",
        "拘系之，乃从维之。王用亨于西山。",
        "孚于嘉，吉。",
        "随有获，贞凶。有孚，在道以明，何咎？",
        "系丈夫，失小子。随有求，得，利居贞。",
        "系小子，失丈夫。",
        "官有渝，贞吉。出门交有功。",
    ],

    ChangesDiagrams.GU : [
        "蛊：元亨，利涉大川。先甲三日，后甲三日。",
        "不事王侯，高尚其事。",
        "干父之蛊，用誉。",
        "裕父之蛊，往见吝。",
        "干父之蛊，小有晦，无大咎。",
        "干母之蛊，不可贞。",
        "干父之蛊，有子，考无咎，厉终吉。",
    ],

    ChangesDiagrams.LIN : [
        "临：元，亨，利，贞。至于八月有凶。",
        "敦临，吉，无咎。",
        "知临，大君之宜，吉。",
        "至临，无咎。",
        "甘临，无攸利。既忧之，无咎。",
        "咸临，吉，无不利。",
        "咸临，贞吉。",
    ],

    ChangesDiagrams.GUAN : [
        "观：盥而不荐，有孚颙若。",
        "观其生，君子无咎。",
        "观我生，君子无咎。",
        "观国之光，利用宾于王。",
        "观我生，进退。",
        "窥观，利女贞。",
        "童观，小人无咎，君子吝。",
    ],

    ChangesDiagrams.SHIKE : [
        "噬嗑：亨。利用狱。",
        "何校灭耳，凶。",
        "噬干肉得黄金。贞厉，无咎。",
        "噬干胏，得金矢。利艰贞，吉。",
        "噬腊肉，遇毒。小吝，无咎。",
        "噬肤灭鼻，无咎。",
        "履校灭趾，无咎。",
    ],

    ChangesDiagrams.BEN : [
        "贲：亨。小利有所往。",
        "白贲，无咎。",
        "贲于丘园，束帛戋戋。吝，终吉。",
        "贲如，皤如，白马翰如，匪寇婚媾。",
        "贲如，濡如，永贞吉。",
        "贲其须。",
        "贲其趾，舍车而徒。",
    ],

    ChangesDiagrams.BO : [
        "剥：不利有攸往。",
        "硕果不食，君子得舆，小人剥庐。",
        "贯鱼。以宫人宠，无不利。",
        "剥床以肤，凶。",
        "剥之，无咎。",
        "剥床以辨，蔑贞，凶。",
        "剥床以足，蔑贞，凶。",
    ],

    ChangesDiagrams.FU : [
        "复：亨。出入无疾，朋来无咎。反复其道，七日来复，利有攸往。",
        "迷复，凶，有灾眚。用行师，终有大败，\n以其国君凶，至于十年，不克征。",
        "敦复，无悔。",
        "中行独复。",
        "频复，厉，无咎。",
        "休复，吉。",
        "不远复，无祗悔，元吉。",
    ],

    ChangesDiagrams.WUWANG : [
        "无妄：元亨利贞。其匪正有眚，不利有攸往。",
        "无妄，行有眚，无攸利。",
        "无妄之疾，勿药有喜。",
        "可贞，无咎。",
        "无妄之灾。或系之牛，行人之得，邑人之灾。",
        "不耕获，不菑畲，则利有攸往。",
        "无妄，往吉。",
    ],

    ChangesDiagrams.DAXU : [
        "大畜：利贞，不家食吉，利涉大川。",
        "何天之衢，亨。",
        "豶豕之牙，吉。",
        "童牛之牿，元吉。",
        "良马逐，利艰贞。曰闲舆卫，利有攸往。",
        "舆说辐。",
        "有厉，利已。",
    ],

    ChangesDiagrams.YI : [
        "颐：贞吉。观颐，自求口实。",
        "由颐，厉吉。利涉大川。",
        "拂经，居贞吉，不可涉大川。",
        "颠颐，吉。虎视眈眈，其欲逐逐，无咎。",
        "拂颐，贞凶。十年勿用，无攸利。",
        "颠颐，拂经，于丘颐，征凶。",
        "舍尔灵龟，观我朵颐，凶。",
    ],

    ChangesDiagrams.DAGUO : [
        "大过：栋桡，利有攸往，亨。",
        "过涉灭顶，凶，无咎。",
        "枯杨生华，老妇得士夫，无咎无誉。",
        "栋隆，吉。它吝。",
        "栋桡，凶。",
        "枯杨生稊，老夫得其女妻，无不利。",
        "藉用白茅，无咎。",
    ],

    ChangesDiagrams.KAN : [
        "坎：习坎，有孚。维心亨。行有尚。",
        "系用徽繹，置于丛棘，三岁不得，凶。",
        "坎不盈，祗既平，无咎。",
        "樽酒簋贰，用缶，纳约自牖，终无咎。",
        "来之坎坎，险且枕，入于坎窞，勿用。",
        "坎有险，求小得。",
        "习坎，入于坎窞，凶。",
    ],

    ChangesDiagrams.LI : [
        "离：利贞，亨。畜牝牛，吉。",
        "王用出征，有嘉。折首，获其匪丑，无咎。",
        "出涕沱若，戚嗟若，吉。",
        "突如其来如，焚如，死如，弃如。",
        "日昃之离，不鼓缶而歌，则大耋之嗟，凶。",
        "黄离，元吉。",
        "履错然，敬之无咎。",
    ],

    ChangesDiagrams.XIAN : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.HENG : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.DUN : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.DAZHUANG : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.JIN : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.MINGYI : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.JIAREN : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.KUI : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.SHUI_SHAN_QIAN : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.JIE : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.SUN : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.FENG_LEI_YI : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.JUE : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.GOU : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.CUI : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.SHENG : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.ZE_SHUI_KUN : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.JING : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.GE : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.DING : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.ZHEN : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.GEN : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.JIAN : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.GUIMEI : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.FENG : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.HUO_SHAN_LV : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.XUN : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.DUI : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.HUAN : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.SHUI_ZE_JIE : [
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ],

    ChangesDiagrams.ZHONGFU : [
        "中孚：豚鱼，吉，利涉大川，利贞。",
        "翰音登于天，贞凶。",
        "有孚挛如，无咎。",
        "月几望，马匹亡，无咎。",
        "得敌，或鼓或罢，或泣或歌。",
        "鸣鹤在阴，其子和之。我有好爵，吾与尔靡之。",
        "虞吉，有它不燕。",
    ],

    ChangesDiagrams.XIAOGUO : [
        "小过：亨，利贞。可小事，不可大事。飞鸟遗之音。不宜上，宜下，大吉。",
        "弗遇过之，飞鸟离之，凶，是谓灾眚。",
        "密云不雨，自我西郊。公弋取彼在穴。",
        "无咎。弗过遇之，往厉必戒，勿用永贞。",
        "弗过防之，从或戕之，凶。",
        "过其祖，遇其妣。不及其君，遇其臣。无咎。",
        "飞鸟以凶。",
    ],

    ChangesDiagrams.JIJI : [
        "既济：亨小，利贞。初吉终乱。",
        "濡其首，厉。",
        "东邻杀牛，不如西邻之禴祭，实受其福。",
        "繻有衣袽，终日戒。",
        "高宗伐鬼方，三年克之，小人勿用。",
        "妇丧其茀，勿逐，七日得。",
        "曳其轮，濡其尾，无咎。",
    ],

    ChangesDiagrams.WEIJI : [
        "未济：亨。小狐汔济，濡其尾，无攸利。",
        "有孚于饮酒，无咎。濡其首，有孚失是。",
        "贞吉，无悔。君子之光，有孚，吉。",
        "贞吉，悔亡，震用伐鬼方。三年有赏于大国。",
        "未济，征凶，利涉大川。",
        "曳其轮，贞吉。",
        "濡其尾，吝。",
    ]
}

